Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/payments_to_families_and_children.html.txt.tmx
Source language: en
Languages: ga

source: Payments to families and children
ga: Na híocaíochtaí do theaghlaigh agus leanaí

source: The Department of Social Protection provides social welfare payments to support families and specifically children
ga: Soláthraíonn an Roinn Coimirce Sóisialaí íocaíochtaí leasa shóisialaigh chun cúnamh a thabhairt do theaghlaigh agus go háirithe do leanaí

source: There are many different types of families and social welfare payments are designed to support those most in need of financial assistance
ga: Tá go leor cineál teaghlach agus is í an aidhm atá leis na híocaíochtaí leasa shóisialaigh ná tacaíocht a thabhairt dóibh siúd a bhfuil géarghá acu le cúnamh airgeadais

source: Find out more about the broad range of rights and entitlements for families
ga: Féach anseo i gcomhair níos mó faisnéise ar an réimse leathan cearta agus teidlíochtaí do theaghlaigh

source: Child Benefit is the most common payment to families with children
ga: Is é Sochar Leanaí an íocaíocht is coitianta do theaghlaigh le leanaí

source: You are entitled to it if you have dependent children that meet the criteria
ga: Tá tú i dteideal an íocaíocht sin a fháil nuair a shásaíonn tú an coinníoll gnáthchónaí agus nuair atá leanaí cleithiúnacha agat, a shásaíonn na coinníollacha iomchuí

source: Other payments depend on your family circumstances and other factors, such as whether you have enough PRSI contributions or you are on a low income
ga: Cuirfear do chúinsí teaghlaigh agus nithe eile san áireamh agus íocaíochtaí eile á meas, mar shampla an bhfuil do dhóthain ranníocaíochtaí ÁSPC íoctha agat, an bhfuil tú ar ioncam íseal

source: Maternity Benefit is paid for 26 weeks to women who are on maternity leave from work and who have paid a certain amount of PRSI (Pay Related Social Insurance)
ga: Íoctar Sochar Máithreachais ar feadh 26 seachtain le mná atá ar saoire máithreachais óna bhfostaíocht nuair atá méid áirithe ÁPSC ( Árachas Sóisialach Pá-Choibhneasa) íoctha acu

source: Paternity Benefit is a payment paid to people on paternity leave from work who have paid a certain amount of PRSI
ga: Íocaíocht nua is ea Sochar Atharthachta a íoctar le daoine atá ar shaoire atharthachta agus a bhfuil atá méid áirithe ÁPSC íoctha acu

source: It is available for any child born or adopted on or after 1 September 2016
ga: Íoctar í i leith páistí a shaolaítear nó a uchtaítear ó 1 Meán Fómhair 2016 amach

source: Health and Safety Benefit is paid to a woman who has sufficient PRSI contributions and is granted Health and Safety Leave from employment
ga: Ciallaíonn Sochar Sláinte agus Sábháilteachta íocaíocht do mhná dá ndeonaítear saoire sláinte agus sábháilteachta agus a bhfuil a ndóthain ranníocaíochtaí ÁSPC acu

source: You may be granted leave if your employer cannot remove a risk to your health while you are pregnant, breastfeeding or involved in night-work, or assign you alternative "risk-free" duties
ga: Tugann d'fhostóir saoire sláinte agus sábháilteachta duit nuair nach féidir leis/léi deireadh a chur le riosca áirithe duitse le linn duit a bheith torrach, ag tabhairt na cíche nó ag obair i rith na hoíche agus nuair nach féidir leis/léi dualgas eile saor ó riosca a thabhairt duit

source: Adoptive Benefit is paid for 24 weeks to an adopting mother or a sole male who adopts a child
ga: Íoctar Sochar Uchtála le máthair nó fear aonair a uchtaíonn leanbh

source: You must satisfy certain social insurance (PRSI) contribution conditions on your own insurance record
ga: Ní mór coinníollacha áirithe um ranníocaíochta árachais shóisialaigh a shásamh i do thaifead árachais féin

source: One-Parent Family Payment (OPF) is paid to men and women who are bringing children up without the support of a partner
ga: Ciallíonn Íocaíocht Teaghlaigh Aontuismitheora íocaíocht do mhná agus fir atá ag tógáil clainne gan páirtí

source: You must satisfy a means test and a habitual residence test
ga: Ní mór duit tástáil acmhainne agus an coinníoll gnáthchónaí a shásamh

source: If you are working you may also get a Single Person Child Carer Credit if you meet the criteria
ga: Má tá tú ag obair, is féidir leat a bheith i dteideal Creidmheas Cánach Cúramóra Linbh do Dhuine Singil

source: You do not have to get OPF to claim this tax credit
ga: Ní gá duit Íocaíocht Teaghlaigh Aontuismitheora a fháil chun an chreidiúint chánach seo a éileamh a fháil

source: Jobseeker's Transitional payment is a special payment for lone parents whose youngest child is aged between 7 and 13 years
ga: Tá an íocaíocht seo ar fáil do dhaoine nach bhfuil ag comhchónaí agus a bhfuil a leanbh is óige idir 7 agus 13 bliana d’aois,

source: A social welfare payment can be paid to the person taking care of an orphaned child up to 18 years of age or up to 22 if he or she is in full-time education
ga: Tugtar Íocaíocht Chaomhnóra do chaomhnóirí dílleachtaí faoi bhun 18 mbliana d'aois nó go dtí 22 bhliain d'aois má tá sé/sí in oideachas lánaimseartha

source: There are three different payments and a child or their guardian may qualify for one of these payments if both parents are dead, or one parent is dead or failed to provide for the child and the other parent is unknown, or has abandoned or failed to provide for the child
ga: Tá trí íocaíocht difriúla ann do dhílleachtaí agus cáilíonn leanbh le haghaidh ceann acu má tá an bheirt thuismitheoirí marbh, nó má tá tuismitheoir amháin marbh nó má dhiúltaigh sé/sí soláthar don leanbh agus má tá an tuismitheoir eile gan fios cé hé é ó í nó má thréig sé/sí an leanbh nó má dhiúltaigh sé/sí soláthar don leanbh

source: Family Income Supplement (FIS) is a weekly tax-free payment available to employees with children
ga: Is íocaíocht sheachtainiúil é an Forlíonadh Ioncaim Teaghlaigh a thugtar saor ó cháin d' fhostóirí le leanaí

source: To qualify you must have at least one child who normally lives with you or is financially supported by you and your net average weekly family income must be below a certain amount for your family size
ga: Le cáiliú, ní mór leanbh amháin ar a laghad a bheith agat atá ina c(h)ónaí leat agus atá á c(h)othú agat agus ní mór meánioncam teaghlaigh seachtainiúil faoi bhun méid áirithe do do líon teaghlaigh a bheith agat

source: It gives financial support to people with qualified children who take up employment or self-employment and as a result stop claiming a jobseeker's payment or a one-parent family payment
ga: Is í aidhm an Liúntas Éadaí agus Coisbhirt don Scoilbhliain Nua ná cúnamh a thabhairt éide scoile agus coisbhirt a cheannach do leanaí ag freastal ar scoil in Éirinn

source: The scheme operates from June to September each year
ga: Feidhmíonn an scéim seo ó 1 Meitheamh go dtí 30 Meán Fómhair gach bliain

source: To qualify, your total household income must be below a certain amount or you must be getting certain social welfare payments
ga: Le cáiliú, caithfidh meánioncam do theaghlaigh a bheith faoi bhun méid áirithe nó caithfidh íocaíochtaí áirithe leasa sóisialaigh a bheith agat

source: Deserted wife's payment is paid to women who were deserted by their husband and have no dependent children
ga: Is íocaíocht é Íocaíocht Banchéile Thréigthe do mhná atá tréigthe ag a bhfear céile agus nach bhfuil aon leanaí cleithiúnacha acu

source: This scheme was closed to new applications in January 1997
ga: Dúnadh an scéim seo d'iarratais nua in Eanáir 1997
